{"modelTopology": {"backend": "tensorflow", "training_config": {"optimizer_config": {"class_name": "SGD", "config": {"decay": 0.0, "momentum": 0.8999999761581421, "lr": 0.0021800000686198473, "nesterov": false}}, "metrics": null, "loss_weights": null, "sample_weight_mode": null, "loss": ["categorical_crossentropy", "mean_squared_error"]}, "model_config": {"class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 2, 6, 7], "dtype": "float32", "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_1", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_1", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_1", "config": {"trainable": true, "dtype": "float32", "name": "activation_1", "activation": "relu"}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_2", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_2", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "name": "activation_2", "config": {"trainable": true, "dtype": "float32", "name": "activation_2", "activation": "relu"}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_3", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_3", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "class_name": "Add", "name": "add_1", "config": {"trainable": true, "dtype": "float32", "name": "add_1"}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_3", "config": {"trainable": true, "dtype": "float32", "name": "activation_3", "activation": "relu"}}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_4", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_4", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "name": "activation_4", "config": {"trainable": true, "dtype": "float32", "name": "activation_4", "activation": "relu"}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_5", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_5", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "class_name": "Add", "name": "add_2", "config": {"trainable": true, "dtype": "float32", "name": "add_2"}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Activation", "name": "activation_5", "config": {"trainable": true, "dtype": "float32", "name": "activation_5", "activation": "relu"}}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_6", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_6", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "name": "activation_6", "config": {"trainable": true, "dtype": "float32", "name": "activation_6", "activation": "relu"}}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_7", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_7", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]], "class_name": "Add", "name": "add_3", "config": {"trainable": true, "dtype": "float32", "name": "add_3"}}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Activation", "name": "activation_7", "config": {"trainable": true, "dtype": "float32", "name": "activation_7", "activation": "relu"}}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_8", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_8", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation", "name": "activation_8", "config": {"trainable": true, "dtype": "float32", "name": "activation_8", "activation": "relu"}}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_9", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_9", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["activation_7", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "class_name": "Add", "name": "add_4", "config": {"trainable": true, "dtype": "float32", "name": "add_4"}}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "Activation", "name": "activation_9", "config": {"trainable": true, "dtype": "float32", "name": "activation_9", "activation": "relu"}}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_10", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_10", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "name": "activation_10", "config": {"trainable": true, "dtype": "float32", "name": "activation_10", "activation": "relu"}}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_11", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_11", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]], "class_name": "Add", "name": "add_5", "config": {"trainable": true, "dtype": "float32", "name": "add_5"}}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "Activation", "name": "activation_11", "config": {"trainable": true, "dtype": "float32", "name": "activation_11", "activation": "relu"}}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_12", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_12", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation", "name": "activation_12", "config": {"trainable": true, "dtype": "float32", "name": "activation_12", "activation": "relu"}}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_13", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_13", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]], "class_name": "Add", "name": "add_6", "config": {"trainable": true, "dtype": "float32", "name": "add_6"}}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "Activation", "name": "activation_13", "config": {"trainable": true, "dtype": "float32", "name": "activation_13", "activation": "relu"}}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_14", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_14", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Activation", "name": "activation_14", "config": {"trainable": true, "dtype": "float32", "name": "activation_14", "activation": "relu"}}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_15", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_15", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["activation_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]], "class_name": "Add", "name": "add_7", "config": {"trainable": true, "dtype": "float32", "name": "add_7"}}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "Activation", "name": "activation_15", "config": {"trainable": true, "dtype": "float32", "name": "activation_15", "activation": "relu"}}, {"inbound_nodes": [[["activation_15", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_16", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_16", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_16", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "Activation", "name": "activation_16", "config": {"trainable": true, "dtype": "float32", "name": "activation_16", "activation": "relu"}}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_17", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_17", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_17", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]], "class_name": "Add", "name": "add_8", "config": {"trainable": true, "dtype": "float32", "name": "add_8"}}, {"inbound_nodes": [[["add_8", 0, 0, {}]]], "class_name": "Activation", "name": "activation_17", "config": {"trainable": true, "dtype": "float32", "name": "activation_17", "activation": "relu"}}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_18", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_18", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_18", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "Activation", "name": "activation_18", "config": {"trainable": true, "dtype": "float32", "name": "activation_18", "activation": "relu"}}, {"inbound_nodes": [[["activation_18", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_19", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_19", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_19", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "class_name": "Add", "name": "add_9", "config": {"trainable": true, "dtype": "float32", "name": "add_9"}}, {"inbound_nodes": [[["add_9", 0, 0, {}]]], "class_name": "Activation", "name": "activation_19", "config": {"trainable": true, "dtype": "float32", "name": "activation_19", "activation": "relu"}}, {"inbound_nodes": [[["activation_19", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_20", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_20", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_20", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "class_name": "Activation", "name": "activation_20", "config": {"trainable": true, "dtype": "float32", "name": "activation_20", "activation": "relu"}}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_21", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_21", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "padding": "same"}}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_21", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["activation_19", 0, 0, {}], ["batch_normalization_21", 0, 0, {}]]], "class_name": "Add", "name": "add_10", "config": {"trainable": true, "dtype": "float32", "name": "add_10"}}, {"inbound_nodes": [[["add_10", 0, 0, {}]]], "class_name": "Activation", "name": "activation_21", "config": {"trainable": true, "dtype": "float32", "name": "activation_21", "activation": "relu"}}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_23", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 4, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_23", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [1, 1], "bias_regularizer": null, "activation": "linear", "padding": "valid"}}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_23", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_23", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "class_name": "Activation", "name": "activation_23", "config": {"trainable": true, "dtype": "float32", "name": "activation_23", "activation": "relu"}}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_22", "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 4, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "data_format": "channels_first", "strides": [1, 1], "name": "conv2d_22", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [1, 1], "bias_regularizer": null, "activation": "linear", "padding": "valid"}}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_2", "config": {"trainable": true, "dtype": "float32", "name": "flatten_2"}}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_22", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["flatten_2", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "use_bias": true, "bias_regularizer": null, "activation": "linear"}}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "class_name": "Activation", "name": "activation_22", "config": {"trainable": true, "dtype": "float32", "name": "activation_22", "activation": "relu"}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_24", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_24", "trainable": true, "axis": 1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "dtype": "float32", "name": "flatten_1"}}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "class_name": "Activation", "name": "activation_24", "config": {"trainable": true, "dtype": "float32", "name": "activation_24", "activation": "relu"}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "name": "policy_out", "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "name": "policy_out", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "units": 7, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "use_bias": true, "bias_regularizer": null, "activation": "softmax"}}, {"inbound_nodes": [[["activation_24", 0, 0, {}]]], "class_name": "Dense", "name": "value_out", "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "name": "value_out", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}}, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "use_bias": true, "bias_regularizer": null, "activation": "tanh"}}], "name": "c4_model", "input_layers": [["input_1", 0, 0]], "output_layers": [["policy_out", 0, 0], ["value_out", 0, 0]]}}, "keras_version": "2.0.8-tf"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_1/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_1/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_1/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_1/moving_variance", "shape": [32]}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_10/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_10/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_10/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_10/moving_variance", "shape": [32]}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_11/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_11/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_11/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_11/moving_variance", "shape": [32]}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_12/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_12/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_12/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_12/moving_variance", "shape": [32]}]}, {"paths": ["group5-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_13/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_13/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_13/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_13/moving_variance", "shape": [32]}]}, {"paths": ["group6-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_14/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_14/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_14/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_14/moving_variance", "shape": [32]}]}, {"paths": ["group7-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_15/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_15/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_15/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_15/moving_variance", "shape": [32]}]}, {"paths": ["group8-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_16/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_16/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_16/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_16/moving_variance", "shape": [32]}]}, {"paths": ["group9-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_17/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_17/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_17/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_17/moving_variance", "shape": [32]}]}, {"paths": ["group10-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_18/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_18/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_18/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_18/moving_variance", "shape": [32]}]}, {"paths": ["group11-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_19/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_19/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_19/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_19/moving_variance", "shape": [32]}]}, {"paths": ["group12-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_2/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_2/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_2/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_2/moving_variance", "shape": [32]}]}, {"paths": ["group13-shard1of1"], "weights": [{"dtype": "float32", "name": "batch_normalization_20/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_20/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_20/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_20/moving_variance", "shape": [32]}]}, {"paths": ["group14-shard1of1"], "weights": [{"dtype": "float32", "name": 