{"modelTopology": {"keras_version": "2.0.8-tf", "backend": "tensorflow", "training_config": {"loss_weights": null, "loss": ["categorical_crossentropy", "mean_squared_error"], "sample_weight_mode": null, "optimizer_config": {"class_name": "SGD", "config": {"momentum": 0.8999999761581421, "lr": 0.009999999776482582, "decay": 0.0, "nesterov": false}}, "metrics": null}, "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 6, 7], "sparse": false, "dtype": "float32", "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_1", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_1", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_1"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_2", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_2", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_2"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_3", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_3", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "dtype": "float32", "name": "add_1"}, "name": "add_1", "inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_3"}, "name": "activation_3", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_4", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_4", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_4"}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_5", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_5", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "dtype": "float32", "name": "add_2"}, "name": "add_2", "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_5"}, "name": "activation_5", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_6", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_6", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_6"}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_7", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_7", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_7", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "dtype": "float32", "name": "add_3"}, "name": "add_3", "inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_7"}, "name": "activation_7", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_8", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_8", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_8"}, "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_9", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_9", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_9", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "dtype": "float32", "name": "add_4"}, "name": "add_4", "inbound_nodes": [[["activation_7", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_9"}, "name": "activation_9", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_10", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_10", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_10"}, "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_11", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_11", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "dtype": "float32", "name": "add_5"}, "name": "add_5", "inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_11"}, "name": "activation_11", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_12", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_12", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_12", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_12"}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_13", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_13", "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_13", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "dtype": "float32", "name": "add_6"}, "name": "add_6", "inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_13"}, "name": "activation_13", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_14", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_14", "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_14", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_14"}, "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_15", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_15", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "dtype": "float32", "name": "add_7"}, "name": "add_7", "inbound_nodes": [[["activation_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_15"}, "name": "activation_15", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_16", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_16", "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_16", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_16"}, "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_17", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_17", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "dtype": "float32", "name": "add_8"}, "name": "add_8", "inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_17"}, "name": "activation_17", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_18", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_18", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_18"}, "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_19", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_19", "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_19", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "dtype": "float32", "name": "add_9"}, "name": "add_9", "inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_19"}, "name": "activation_19", "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_20", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_20", "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_20", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_20"}, "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_21", "padding": "same", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "name": "conv2d_21", "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_21", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "dtype": "float32", "name": "add_10"}, "name": "add_10", "inbound_nodes": [[["activation_19", 0, 0, {}], ["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_21"}, "name": "activation_21", "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_23", "padding": "valid", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null}, "name": "conv2d_23", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_23", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_23"}, "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "filters": 4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d_22", "padding": "valid", "data_format": "channels_first", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null}, "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "dtype": "float32", "name": "flatten_2"}, "name": "flatten_2", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_22", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "dense_1", "activation": "linear", "trainable": true, "units": 128, "bias_constraint": null, "activity_regularizer": null}, "name": "dense_1", "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_22"}, "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": 1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_24", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "trainable": true, "center": true, "dtype": "float32", "epsilon": 0.001}, "name": "batch_normalization_24", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "dtype": "float32", "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_24"}, "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "policy_out", "activation": "softmax", "trainable": true, "units": 7, "bias_constraint": null, "activity_regularizer": null}, "name": "policy_out", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "value_out", "activation": "tanh", "trainable": true, "units": 1, "bias_constraint": null, "activity_regularizer": null}, "name": "value_out", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}], "output_layers": [["policy_out", 0, 0], ["value_out", 0, 0]], "name": "c4_model", "input_layers": [["input_1", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_1/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_1/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_1/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_1/moving_variance"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_10/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_10/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_10/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_10/moving_variance"}]}, {"paths": ["group3-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_11/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_11/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_11/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_11/moving_variance"}]}, {"paths": ["group4-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_12/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_12/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_12/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_12/moving_variance"}]}, {"paths": ["group5-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_13/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_13/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_13/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_13/moving_variance"}]}, {"paths": ["group6-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_14/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_14/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_14/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_14/moving_variance"}]}, {"paths": ["group7-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_15/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_15/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_15/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_15/moving_variance"}]}, {"paths": ["group8-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_16/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_16/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_16/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_16/moving_variance"}]}, {"paths": ["group9-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_17/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_17/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_17/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_17/moving_variance"}]}, {"paths": ["group10-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_18/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_18/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_18/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_18/moving_variance"}]}, {"paths": ["group11-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_19/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_19/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_19/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_19/moving_variance"}]}, {"paths": ["group12-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_2/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_2/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_2/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_2/moving_variance"}]}, {"paths": ["group13-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_20/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_20/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_20/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_20/moving_variance"}]}, {"paths": ["group14-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": 