{"modelTopology": {"backend": "tensorflow", "keras_version": "2.0.8-tf", "model_config": {"config": {"output_layers": [["policy_out", 0, 0], ["value_out", 0, 0]], "name": "c4_model", "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 2, 6, 7], "name": "input_1", "dtype": "float32", "sparse": false}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_1", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_1", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_1", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_1", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "activation_1", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_1", "class_name": "Activation"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_2", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_2", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_2", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_2", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "activation_2", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_2", "class_name": "Activation"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_3", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_3", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_3", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_3", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "config": {"name": "add_1", "dtype": "float32", "trainable": true}, "name": "add_1", "class_name": "Add"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "activation_3", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_3", "class_name": "Activation"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_4", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_4", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_4", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_4", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "activation_4", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_4", "class_name": "Activation"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_5", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_5", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_5", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_5", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "config": {"name": "add_2", "dtype": "float32", "trainable": true}, "name": "add_2", "class_name": "Add"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "activation_5", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_5", "class_name": "Activation"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_6", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_6", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_6", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_6", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"name": "activation_6", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_6", "class_name": "Activation"}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_7", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_7", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_7", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_7", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]], "config": {"name": "add_3", "dtype": "float32", "trainable": true}, "name": "add_3", "class_name": "Add"}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "activation_7", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_7", "class_name": "Activation"}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_8", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_8", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_8", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_8", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"name": "activation_8", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_8", "class_name": "Activation"}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_9", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_9", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_9", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_9", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["activation_7", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "config": {"name": "add_4", "dtype": "float32", "trainable": true}, "name": "add_4", "class_name": "Add"}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "activation_9", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_9", "class_name": "Activation"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_10", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_10", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_10", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_10", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"name": "activation_10", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_10", "class_name": "Activation"}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_11", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_11", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_11", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_11", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]], "config": {"name": "add_5", "dtype": "float32", "trainable": true}, "name": "add_5", "class_name": "Add"}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"name": "activation_11", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_11", "class_name": "Activation"}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_12", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_12", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_12", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_12", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"name": "activation_12", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_12", "class_name": "Activation"}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_13", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_13", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_13", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_13", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]], "config": {"name": "add_6", "dtype": "float32", "trainable": true}, "name": "add_6", "class_name": "Add"}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"name": "activation_13", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_13", "class_name": "Activation"}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_14", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_14", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_14", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_14", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"name": "activation_14", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_14", "class_name": "Activation"}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_15", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_15", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_15", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_15", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["activation_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]], "config": {"name": "add_7", "dtype": "float32", "trainable": true}, "name": "add_7", "class_name": "Add"}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"name": "activation_15", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_15", "class_name": "Activation"}, {"inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_16", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_16", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_16", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_16", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"name": "activation_16", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_16", "class_name": "Activation"}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_17", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_17", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_17", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_17", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]], "config": {"name": "add_8", "dtype": "float32", "trainable": true}, "name": "add_8", "class_name": "Add"}, {"inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"name": "activation_17", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_17", "class_name": "Activation"}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_18", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_18", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_18", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_18", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"name": "activation_18", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_18", "class_name": "Activation"}, {"inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_19", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_19", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_19", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_19", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "config": {"name": "add_9", "dtype": "float32", "trainable": true}, "name": "add_9", "class_name": "Add"}, {"inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"name": "activation_19", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_19", "class_name": "Activation"}, {"inbound_nodes": [[["activation_19", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_20", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_20", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_20", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_20", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"name": "activation_20", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_20", "class_name": "Activation"}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_21", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "same", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_21", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_21", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_21", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["activation_19", 0, 0, {}], ["batch_normalization_21", 0, 0, {}]]], "config": {"name": "add_10", "dtype": "float32", "trainable": true}, "name": "add_10", "class_name": "Add"}, {"inbound_nodes": [[["add_10", 0, 0, {}]]], "config": {"name": "activation_21", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_21", "class_name": "Activation"}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_23", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "valid", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [1, 1], "filters": 4, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_23", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_23", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_23", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"name": "activation_23", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_23", "class_name": "Activation"}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_22", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "trainable": true, "padding": "valid", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [1, 1], "filters": 4, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null}, "name": "conv2d_22", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"name": "flatten_2", "dtype": "float32", "trainable": true}, "name": "flatten_2", "class_name": "Flatten"}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_22", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_22", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["flatten_2", 0, 0, {}]]], "config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "name": "dense_1", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "units": 128, "trainable": true, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null}, "name": "dense_1", "class_name": "Dense"}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"name": "activation_22", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_22", "class_name": "Activation"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_24", "gamma_constraint": null, "beta_regularizer": null}, "name": "batch_normalization_24", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"name": "flatten_1", "dtype": "float32", "trainable": true}, "name": "flatten_1", "class_name": "Flatten"}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"name": "activation_24", "dtype": "float32", "activation": "relu", "trainable": true}, "name": "activation_24", "class_name": "Activation"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "name": "policy_out", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "softmax", "units": 7, "trainable": true, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null}, "name": "policy_out", "class_name": "Dense"}, {"inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "name": "value_out", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "tanh", "units": 1, "trainable": true, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null}, "name": "value_out", "class_name": "Dense"}]}, "class_name": "Model"}, "training_config": {"optimizer_config": {"config": {"decay": 0.0, "lr": 0.0021800000686198473, "momentum": 0.8999999761581421, "nesterov": false}, "class_name": "SGD"}, "loss_weights": null, "loss": ["categorical_crossentropy", "mean_squared_error"], "metrics": null, "sample_weight_mode": null}}, "weightsManifest": [{"weights": [{"name": "batch_normalization_1/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_1/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_1/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_1/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group1-shard1of1"]}, {"weights": [{"name": "batch_normalization_10/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_10/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_10/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_10/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group2-shard1of1"]}, {"weights": [{"name": "batch_normalization_11/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_11/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_11/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_11/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group3-shard1of1"]}, {"weights": [{"name": "batch_normalization_12/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_12/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_12/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_12/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group4-shard1of1"]}, {"weights": [{"name": "batch_normalization_13/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_13/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_13/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_13/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group5-shard1of1"]}, {"weights": [{"name": "batch_normalization_14/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_14/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_14/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_14/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group6-shard1of1"]}, {"weights": [{"name": "batch_normalization_15/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_15/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_15/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_15/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group7-shard1of1"]}, {"weights": [{"name": "batch_normalization_16/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_16/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_16/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_16/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group8-shard1of1"]}, {"weights": [{"name": "batch_normalization_17/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_17/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_17/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_17/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group9-shard1of1"]}, {"weights": [{"name": "batch_normalization_18/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_18/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_18/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_18/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group10-shard1of1"]}, {"weights": [{"name": "batch_normalization_19/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_19/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_19/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_19/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group11-shard1of1"]}, {"weights": [{"name": "batch_normalization_2/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_2/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_2/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_2/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group12-shard1of1"]}, {"weights": [{"name": "batch_normalization_20/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_20/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_20/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_20/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group13-shard1of1"]}, {"weights": [{"name": "batch_normalization_21/gamma", "dtype": "float32", "shape": [32]}, {"name": 