{"modelTopology": {"keras_version": "2.0.8-tf", "backend": "tensorflow", "model_config": {"config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 2, 6, 7], "sparse": false, "name": "input_1", "dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_1", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_1", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_1", "config": {"trainable": true, "dtype": "float32", "name": "activation_1", "activation": "relu"}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_2", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_2", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "name": "activation_2", "config": {"trainable": true, "dtype": "float32", "name": "activation_2", "activation": "relu"}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_3", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_3", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "class_name": "Add", "name": "add_1", "config": {"trainable": true, "name": "add_1", "dtype": "float32"}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_3", "config": {"trainable": true, "dtype": "float32", "name": "activation_3", "activation": "relu"}}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_4", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_4", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "name": "activation_4", "config": {"trainable": true, "dtype": "float32", "name": "activation_4", "activation": "relu"}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_5", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_5", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "class_name": "Add", "name": "add_2", "config": {"trainable": true, "name": "add_2", "dtype": "float32"}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Activation", "name": "activation_5", "config": {"trainable": true, "dtype": "float32", "name": "activation_5", "activation": "relu"}}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_6", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_6", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "name": "activation_6", "config": {"trainable": true, "dtype": "float32", "name": "activation_6", "activation": "relu"}}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_7", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_7", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]], "class_name": "Add", "name": "add_3", "config": {"trainable": true, "name": "add_3", "dtype": "float32"}}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Activation", "name": "activation_7", "config": {"trainable": true, "dtype": "float32", "name": "activation_7", "activation": "relu"}}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_8", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_8", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation", "name": "activation_8", "config": {"trainable": true, "dtype": "float32", "name": "activation_8", "activation": "relu"}}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_9", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_9", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["activation_7", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "class_name": "Add", "name": "add_4", "config": {"trainable": true, "name": "add_4", "dtype": "float32"}}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "Activation", "name": "activation_9", "config": {"trainable": true, "dtype": "float32", "name": "activation_9", "activation": "relu"}}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_10", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_10", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "name": "activation_10", "config": {"trainable": true, "dtype": "float32", "name": "activation_10", "activation": "relu"}}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_11", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_11", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]], "class_name": "Add", "name": "add_5", "config": {"trainable": true, "name": "add_5", "dtype": "float32"}}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "Activation", "name": "activation_11", "config": {"trainable": true, "dtype": "float32", "name": "activation_11", "activation": "relu"}}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_12", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_12", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation", "name": "activation_12", "config": {"trainable": true, "dtype": "float32", "name": "activation_12", "activation": "relu"}}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_13", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_13", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]], "class_name": "Add", "name": "add_6", "config": {"trainable": true, "name": "add_6", "dtype": "float32"}}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "Activation", "name": "activation_13", "config": {"trainable": true, "dtype": "float32", "name": "activation_13", "activation": "relu"}}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_14", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_14", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Activation", "name": "activation_14", "config": {"trainable": true, "dtype": "float32", "name": "activation_14", "activation": "relu"}}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_15", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_15", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["activation_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]], "class_name": "Add", "name": "add_7", "config": {"trainable": true, "name": "add_7", "dtype": "float32"}}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "Activation", "name": "activation_15", "config": {"trainable": true, "dtype": "float32", "name": "activation_15", "activation": "relu"}}, {"inbound_nodes": [[["activation_15", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_16", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_16", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_16", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "Activation", "name": "activation_16", "config": {"trainable": true, "dtype": "float32", "name": "activation_16", "activation": "relu"}}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_17", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_17", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_17", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]], "class_name": "Add", "name": "add_8", "config": {"trainable": true, "name": "add_8", "dtype": "float32"}}, {"inbound_nodes": [[["add_8", 0, 0, {}]]], "class_name": "Activation", "name": "activation_17", "config": {"trainable": true, "dtype": "float32", "name": "activation_17", "activation": "relu"}}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_18", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_18", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_18", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "Activation", "name": "activation_18", "config": {"trainable": true, "dtype": "float32", "name": "activation_18", "activation": "relu"}}, {"inbound_nodes": [[["activation_18", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_19", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_19", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_19", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "class_name": "Add", "name": "add_9", "config": {"trainable": true, "name": "add_9", "dtype": "float32"}}, {"inbound_nodes": [[["add_9", 0, 0, {}]]], "class_name": "Activation", "name": "activation_19", "config": {"trainable": true, "dtype": "float32", "name": "activation_19", "activation": "relu"}}, {"inbound_nodes": [[["activation_19", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_20", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_20", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_20", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "class_name": "Activation", "name": "activation_20", "config": {"trainable": true, "dtype": "float32", "name": "activation_20", "activation": "relu"}}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_21", "config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_21", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_21", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["activation_19", 0, 0, {}], ["batch_normalization_21", 0, 0, {}]]], "class_name": "Add", "name": "add_10", "config": {"trainable": true, "name": "add_10", "dtype": "float32"}}, {"inbound_nodes": [[["add_10", 0, 0, {}]]], "class_name": "Activation", "name": "activation_21", "config": {"trainable": true, "dtype": "float32", "name": "activation_21", "activation": "relu"}}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_23", "config": {"activity_regularizer": null, "use_bias": true, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 4, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [1, 1], "name": "conv2d_23", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_23", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_23", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "class_name": "Activation", "name": "activation_23", "config": {"trainable": true, "dtype": "float32", "name": "activation_23", "activation": "relu"}}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_22", "config": {"activity_regularizer": null, "use_bias": true, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 4, "data_format": "channels_first", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [1, 1], "name": "conv2d_22", "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_2", "config": {"trainable": true, "name": "flatten_2", "dtype": "float32"}}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_22", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["flatten_2", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "units": 128, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "activation": "linear", "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "class_name": "Activation", "name": "activation_22", "config": {"trainable": true, "dtype": "float32", "name": "activation_22", "activation": "relu"}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_24", "config": {"gamma_regularizer": null, "epsilon": 0.001, "dtype": "float32", "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_24", "trainable": true, "axis": 1, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1", "dtype": "float32"}}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "class_name": "Activation", "name": "activation_24", "config": {"trainable": true, "dtype": "float32", "name": "activation_24", "activation": "relu"}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "name": "policy_out", "config": {"activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "units": 7, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "policy_out", "activation": "softmax", "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["activation_24", 0, 0, {}]]], "class_name": "Dense", "name": "value_out", "config": {"activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "units": 1, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "value_out", "activation": "tanh", "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}], "output_layers": [["policy_out", 0, 0], ["value_out", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "c4_model"}, "class_name": "Model"}, "training_config": {"sample_weight_mode": null, "loss": ["categorical_crossentropy", "mean_squared_error"], "optimizer_config": {"config": {"lr": 0.004999999888241291, "momentum": 0.8999999761581421, "decay": 0.0, "nesterov": false}, "class_name": "SGD"}, "metrics": null, "loss_weights": null}}, "weightsManifest": [{"weights": [{"shape": [32], "name": "batch_normalization_1/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_1/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_1/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_1/moving_variance", "dtype": "float32"}], "paths": ["group1-shard1of1"]}, {"weights": [{"shape": [32], "name": "batch_normalization_10/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_10/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_10/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_10/moving_variance", "dtype": "float32"}], "paths": ["group2-shard1of1"]}, {"weights": [{"shape": [32], "name": "batch_normalization_11/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_11/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_11/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_11/moving_variance", "dtype": "float32"}], "paths": ["group3-shard1of1"]}, {"weights": [{"shape": [32], "name": "batch_normalization_12/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_12/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_12/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_12/moving_variance", "dtype": "float32"}], "paths": ["group4-shard1of1"]}, {"weights": [{"shape": [32], "name": "batch_normalization_13/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_13/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_13/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_13/moving_variance", "dtype": "float32"}], "paths": ["group5-shard1of1"]}, {"weights": [{"shape": [32], "name": "batch_normalization_14/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_14/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_14/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_14/moving_variance", "dtype": "float32"}], "paths": ["group6-shard1of1"]}, {"weights": [{"shape": [32], "name": "batch_normalization_15/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_15/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_15/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_15/moving_variance", "dtype": "float32"}], "paths": ["group7-shard1of1"]}, {"weights": [{"shape": [32], "name": "batch_normalization_16/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_16/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_16/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_16/moving_variance", "dtype": "float32"}], "paths": ["group8-shard1of1"]}, {"weights": [{"shape": [32], "name": "batch_normalization_17/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_17/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_17/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_17/moving_variance", "dtype": "float32"}], "paths": ["group9-shard1of1"]}, {"weights": [{"shape": [32], "name": "batch_normalization_18/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_18/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_18/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_18/moving_variance", "dtype": "float32"}], "paths": ["group10-shard1of1"]}, {"weights": [{"shape": [32], "name": "batch_normalization_19/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_19/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_19/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_19/moving_variance", "dtype": "float32"}], "paths": ["group11-shard1of1"]}, {"weights": [{"shape": [32], "name": "batch_normalization_2/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_2/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_2/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_2/moving_variance", "dtype": "float32"}], "paths": ["group12-shard1of1"]}, {"weights": [{"shape": [32], "name": "batch_normalization_20/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_20/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_20/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_20/moving_variance", "dtype": "float32"}], "paths": ["group13-shard1of1"]}, {"weights": [{"shape": [32], "name": "batch_normalization_21/gamma", "dtype": "float32"}, {"shape": 