{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_1/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_1/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_1/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_1/moving_variance", "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_10/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_10/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_10/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_10/moving_variance", "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_11/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_11/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_11/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_11/moving_variance", "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_12/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_12/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_12/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_12/moving_variance", "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_13/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_13/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_13/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_13/moving_variance", "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_14/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_14/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_14/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_14/moving_variance", "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_15/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_15/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_15/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_15/moving_variance", "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_16/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_16/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_16/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_16/moving_variance", "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_17/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_17/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_17/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_17/moving_variance", "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_18/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_18/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_18/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_18/moving_variance", "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_19/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_19/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_19/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_19/moving_variance", "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_2/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_2/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_2/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_20/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_20/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_20/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_20/moving_variance", "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_21/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_21/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_21/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_21/moving_variance", "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"shape": [4], "name": "batch_normalization_22/gamma", "dtype": "float32"}, {"shape": [4], "name": "batch_normalization_22/beta", "dtype": "float32"}, {"shape": [4], "name": "batch_normalization_22/moving_mean", "dtype": "float32"}, {"shape": [4], "name": "batch_normalization_22/moving_variance", "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"shape": [4], "name": "batch_normalization_23/gamma", "dtype": "float32"}, {"shape": [4], "name": "batch_normalization_23/beta", "dtype": "float32"}, {"shape": [4], "name": "batch_normalization_23/moving_mean", "dtype": "float32"}, {"shape": [4], "name": "batch_normalization_23/moving_variance", "dtype": "float32"}]}, {"paths": ["group17-shard1of1"], "weights": [{"shape": [128], "name": "batch_normalization_24/gamma", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_24/beta", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_24/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_24/moving_variance", "dtype": "float32"}]}, {"paths": ["group18-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_3/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_3/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_3/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_3/moving_variance", "dtype": "float32"}]}, {"paths": ["group19-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_4/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_4/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_4/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_4/moving_variance", "dtype": "float32"}]}, {"paths": ["group20-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_5/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_5/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_5/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_5/moving_variance", "dtype": "float32"}]}, {"paths": ["group21-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_6/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_6/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_6/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_6/moving_variance", "dtype": "float32"}]}, {"paths": ["group22-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_7/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_7/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_7/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_7/moving_variance", "dtype": "float32"}]}, {"paths": ["group23-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_8/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_8/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_8/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_8/moving_variance", "dtype": "float32"}]}, {"paths": ["group24-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_9/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_9/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_9/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_9/moving_variance", "dtype": "float32"}]}, {"paths": ["group25-shard1of1"], "weights": [{"shape": [3, 3, 2, 32], "name": "conv2d_1/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_1/bias", "dtype": "float32"}]}, {"paths": ["group26-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_10/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_10/bias", "dtype": "float32"}]}, {"paths": ["group27-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_11/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_11/bias", "dtype": "float32"}]}, {"paths": ["group28-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_12/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_12/bias", "dtype": "float32"}]}, {"paths": ["group29-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_13/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_13/bias", "dtype": "float32"}]}, {"paths": ["group30-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_14/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_14/bias", "dtype": "float32"}]}, {"paths": ["group31-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_15/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_15/bias", "dtype": "float32"}]}, {"paths": ["group32-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_16/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_16/bias", "dtype": "float32"}]}, {"paths": ["group33-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_17/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_17/bias", "dtype": "float32"}]}, {"paths": ["group34-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_18/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_18/bias", "dtype": "float32"}]}, {"paths": ["group35-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_19/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_19/bias", "dtype": "float32"}]}, {"paths": ["group36-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_2/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_2/bias", "dtype": "float32"}]}, {"paths": ["group37-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_20/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_20/bias", "dtype": "float32"}]}, {"paths": ["group38-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_21/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_21/bias", "dtype": "float32"}]}, {"paths": ["group39-shard1of1"], "weights": [{"shape": [1, 1, 32, 4], "name": "conv2d_22/kernel", "dtype": "float32"}, {"shape": [4], "name": "conv2d_22/bias", "dtype": "float32"}]}, {"paths": ["group40-shard1of1"], "weights": [{"shape": [1, 1, 32, 4], "name": "conv2d_23/kernel", "dtype": "float32"}, {"shape": [4], "name": "conv2d_23/bias", "dtype": "float32"}]}, {"paths": ["group41-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_3/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_3/bias", "dtype": "float32"}]}, {"paths": ["group42-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_4/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_4/bias", "dtype": "float32"}]}, {"paths": ["group43-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_5/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_5/bias", "dtype": "float32"}]}, {"paths": ["group44-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_6/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_6/bias", "dtype": "float32"}]}, {"paths": ["group45-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_7/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_7/bias", "dtype": "float32"}]}, {"paths": ["group46-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_8/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_8/bias", "dtype": "float32"}]}, {"paths": ["group47-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_9/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_9/bias", "dtype": "float32"}]}, {"paths": ["group48-shard1of1"], "weights": [{"shape": [168, 128], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [128], "name": "dense_1/bias", "dtype": "float32"}]}, {"paths": ["group49-shard1of1"], "weights": [{"shape": [168, 7], "name": "policy_out/kernel", "dtype": "float32"}, {"shape": [7], "name": "policy_out/bias", "dtype": "float32"}]}, {"paths": ["group50-shard1of1"], "weights": [{"shape": [128, 1], "name": "value_out/kernel", "dtype": "float32"}, {"shape": [1], "name": "value_out/bias", "dtype": "float32"}]}], "modelTopology": {"keras_version": "2.0.8-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 2, 6, 7], "name": "input_1", "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_1", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_1", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_2", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_2", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_2", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_3", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_3", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_1", "inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "name": "add_1", "dtype": "float32"}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_3", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_4", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_4", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_4", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_5", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_5", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_2", "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "config": {"trainable": true, "name": "add_2", "dtype": "float32"}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_5", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_6", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_6", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_6", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_7", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_7", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_3", "inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]], "config": {"trainable": true, "name": "add_3", "dtype": "float32"}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_7", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_8", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_8", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_8", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_9", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_9", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_4", "inbound_nodes": [[["activation_7", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "config": {"trainable": true, "name": "add_4", "dtype": "float32"}}, {"class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_9", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_10", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_10", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_10", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_11", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_11", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_5", "inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]], "config": {"trainable": true, "name": "add_5", "dtype": "float32"}}, {"class_name": "Activation", "name": "activation_11", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_11", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_12", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_12", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_12", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_13", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_13", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_6", "inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]], "config": {"trainable": true, "name": "add_6", "dtype": "float32"}}, {"class_name": "Activation", "name": "activation_13", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_13", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_14", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_14", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_14", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_15", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_15", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_7", "inbound_nodes": [[["activation_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]], "config": {"trainable": true, "name": "add_7", "dtype": "float32"}}, {"class_name": "Activation", "name": "activation_15", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_15", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_16", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_16", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_16", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_17", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_17", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_8", "inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]], "config": {"trainable": true, "name": "add_8", "dtype": "float32"}}, {"class_name": "Activation", "name": "activation_17", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_17", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_18", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_18", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_18", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_19", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_19", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_19", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_9", "inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "config": {"trainable": true, "name": "add_9", "dtype": "float32"}}, {"class_name": "Activation", "name": "activation_19", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_19", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_20", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_20", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32"}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_20", "scale": true, "axis": 1, "dtype": "float32", "trainable": true, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_20", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_21", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_21", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 