{"modelTopology": {"keras_version": "2.0.8-tf", "backend": "tensorflow", "training_config": {"sample_weight_mode": null, "loss": ["categorical_crossentropy", "mean_squared_error"], "metrics": null, "loss_weights": null, "optimizer_config": {"config": {"nesterov": false, "decay": 0.0, "momentum": 0.8999999761581421, "lr": 0.0006249999860301614}, "class_name": "SGD"}}, "model_config": {"config": {"name": "c4_model", "output_layers": [["policy_out", 0, 0], ["value_out", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 2, 6, 7]}, "class_name": "InputLayer"}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_1", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_1", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "activation_1", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_2", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "activation_2", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_3", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_3", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "add_1", "inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "config": {"name": "add_1", "dtype": "float32", "trainable": true}, "class_name": "Add"}, {"name": "activation_3", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "activation_3", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_4", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_4", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "activation_4", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_5", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_5", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "add_2", "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "config": {"name": "add_2", "dtype": "float32", "trainable": true}, "class_name": "Add"}, {"name": "activation_5", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "activation_5", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_6", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_6", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"name": "activation_6", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_7", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_7", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_7", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "add_3", "inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]], "config": {"name": "add_3", "dtype": "float32", "trainable": true}, "class_name": "Add"}, {"name": "activation_7", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "activation_7", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_8", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_8", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"name": "activation_8", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_9", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_9", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_9", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "add_4", "inbound_nodes": [[["activation_7", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "config": {"name": "add_4", "dtype": "float32", "trainable": true}, "class_name": "Add"}, {"name": "activation_9", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "activation_9", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_10", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_10", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"name": "activation_10", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_11", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_11", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "add_5", "inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]], "config": {"name": "add_5", "dtype": "float32", "trainable": true}, "class_name": "Add"}, {"name": "activation_11", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"name": "activation_11", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_12", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_12", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_12", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"name": "activation_12", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_13", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_13", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_13", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "add_6", "inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]], "config": {"name": "add_6", "dtype": "float32", "trainable": true}, "class_name": "Add"}, {"name": "activation_13", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"name": "activation_13", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_14", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_14", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_14", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"name": "activation_14", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_15", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_15", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "add_7", "inbound_nodes": [[["activation_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]], "config": {"name": "add_7", "dtype": "float32", "trainable": true}, "class_name": "Add"}, {"name": "activation_15", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"name": "activation_15", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_16", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_16", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_16", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"name": "activation_16", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_17", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_17", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "add_8", "inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]], "config": {"name": "add_8", "dtype": "float32", "trainable": true}, "class_name": "Add"}, {"name": "activation_17", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"name": "activation_17", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_18", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_18", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"name": "activation_18", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_19", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_19", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_19", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "add_9", "inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "config": {"name": "add_9", "dtype": "float32", "trainable": true}, "class_name": "Add"}, {"name": "activation_19", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"name": "activation_19", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_20", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_20", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_20", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"name": "activation_20", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_21", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_21", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_21", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "add_10", "inbound_nodes": [[["activation_19", 0, 0, {}], ["batch_normalization_21", 0, 0, {}]]], "config": {"name": "add_10", "dtype": "float32", "trainable": true}, "class_name": "Add"}, {"name": "activation_21", "inbound_nodes": [[["add_10", 0, 0, {}]]], "config": {"name": "activation_21", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_22", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_22", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"name": "activation_22", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_23", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_23", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_23", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "add_11", "inbound_nodes": [[["activation_21", 0, 0, {}], ["batch_normalization_23", 0, 0, {}]]], "config": {"name": "add_11", "dtype": "float32", "trainable": true}, "class_name": "Add"}, {"name": "activation_23", "inbound_nodes": [[["add_11", 0, 0, {}]]], "config": {"name": "activation_23", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_24", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_24", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"name": "activation_24", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_25", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_25", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "add_12", "inbound_nodes": [[["activation_23", 0, 0, {}], ["batch_normalization_25", 0, 0, {}]]], "config": {"name": "add_12", "dtype": "float32", "trainable": true}, "class_name": "Add"}, {"name": "activation_25", "inbound_nodes": [[["add_12", 0, 0, {}]]], "config": {"name": "activation_25", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_26", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_26", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_26", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "config": {"name": "activation_26", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_27", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_27", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, "class_name": "Conv2D"}, {"name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "config": {"beta_constraint": null, "axis": 1, "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_27", "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "add_13", "inbound_nodes": [[["activation_25", 0, 0, {}], ["batch_normalization_27", 0, 0, {}]]], "config": {"name": "add_13", "dtype": "float32", "trainable": true}, "class_name": "Add"}, {"name": "activation_27", "inbound_nodes": [[["add_13", 0, 0, {}]]], "config": {"name": "activation_27", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_28", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "config": {"padding": "same", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_28", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "activation": "linear"}, 