{"weightsManifest": [{"weights": [{"dtype": "float32", "name": "batch_normalization_1/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_1/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_1/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_1/moving_variance", "shape": [32]}], "paths": ["group1-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_10/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_10/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_10/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_10/moving_variance", "shape": [32]}], "paths": ["group2-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_11/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_11/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_11/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_11/moving_variance", "shape": [32]}], "paths": ["group3-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_12/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_12/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_12/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_12/moving_variance", "shape": [32]}], "paths": ["group4-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_13/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_13/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_13/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_13/moving_variance", "shape": [32]}], "paths": ["group5-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_14/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_14/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_14/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_14/moving_variance", "shape": [32]}], "paths": ["group6-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_15/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_15/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_15/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_15/moving_variance", "shape": [32]}], "paths": ["group7-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_16/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_16/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_16/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_16/moving_variance", "shape": [32]}], "paths": ["group8-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_17/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_17/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_17/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_17/moving_variance", "shape": [32]}], "paths": ["group9-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_18/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_18/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_18/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_18/moving_variance", "shape": [32]}], "paths": ["group10-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_19/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_19/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_19/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_19/moving_variance", "shape": [32]}], "paths": ["group11-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_2/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_2/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_2/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_2/moving_variance", "shape": [32]}], "paths": ["group12-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_20/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_20/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_20/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_20/moving_variance", "shape": [32]}], "paths": ["group13-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_21/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_21/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_21/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_21/moving_variance", "shape": [32]}], "paths": ["group14-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_22/gamma", "shape": [4]}, {"dtype": "float32", "name": "batch_normalization_22/beta", "shape": [4]}, {"dtype": "float32", "name": "batch_normalization_22/moving_mean", "shape": [4]}, {"dtype": "float32", "name": "batch_normalization_22/moving_variance", "shape": [4]}], "paths": ["group15-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_23/gamma", "shape": [4]}, {"dtype": "float32", "name": "batch_normalization_23/beta", "shape": [4]}, {"dtype": "float32", "name": "batch_normalization_23/moving_mean", "shape": [4]}, {"dtype": "float32", "name": "batch_normalization_23/moving_variance", "shape": [4]}], "paths": ["group16-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_24/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_24/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_24/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_24/moving_variance", "shape": [128]}], "paths": ["group17-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_3/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_3/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_3/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_3/moving_variance", "shape": [32]}], "paths": ["group18-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_4/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_4/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_4/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_4/moving_variance", "shape": [32]}], "paths": ["group19-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_5/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_5/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_5/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_5/moving_variance", "shape": [32]}], "paths": ["group20-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_6/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_6/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_6/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_6/moving_variance", "shape": [32]}], "paths": ["group21-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_7/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_7/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_7/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_7/moving_variance", "shape": [32]}], "paths": ["group22-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_8/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_8/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_8/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_8/moving_variance", "shape": [32]}], "paths": ["group23-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_9/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_9/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_9/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_9/moving_variance", "shape": [32]}], "paths": ["group24-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_1/kernel", "shape": [3, 3, 2, 32]}, {"dtype": "float32", "name": "conv2d_1/bias", "shape": [32]}], "paths": ["group25-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_10/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_10/bias", "shape": [32]}], "paths": ["group26-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_11/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_11/bias", "shape": [32]}], "paths": ["group27-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_12/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_12/bias", "shape": [32]}], "paths": ["group28-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_13/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_13/bias", "shape": [32]}], "paths": ["group29-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_14/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_14/bias", "shape": [32]}], "paths": ["group30-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_15/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_15/bias", "shape": [32]}], "paths": ["group31-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_16/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_16/bias", "shape": [32]}], "paths": ["group32-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_17/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_17/bias", "shape": [32]}], "paths": ["group33-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_18/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_18/bias", "shape": [32]}], "paths": ["group34-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_19/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_19/bias", "shape": [32]}], "paths": ["group35-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_2/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_2/bias", "shape": [32]}], "paths": ["group36-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_20/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_20/bias", "shape": [32]}], "paths": ["group37-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_21/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_21/bias", "shape": [32]}], "paths": ["group38-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_22/kernel", "shape": [1, 1, 32, 4]}, {"dtype": "float32", "name": "conv2d_22/bias", "shape": [4]}], "paths": ["group39-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_23/kernel", "shape": [1, 1, 32, 4]}, {"dtype": "float32", "name": "conv2d_23/bias", "shape": [4]}], "paths": ["group40-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_3/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_3/bias", "shape": [32]}], "paths": ["group41-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_4/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_4/bias", "shape": [32]}], "paths": ["group42-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_5/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_5/bias", "shape": [32]}], "paths": ["group43-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_6/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_6/bias", "shape": [32]}], "paths": ["group44-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_7/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_7/bias", "shape": [32]}], "paths": ["group45-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_8/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_8/bias", "shape": [32]}], "paths": ["group46-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_9/kernel", "shape": [3, 3, 32, 32]}, {"dtype": "float32", "name": "conv2d_9/bias", "shape": [32]}], "paths": ["group47-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "dense_1/kernel", "shape": [168, 128]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [128]}], "paths": ["group48-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "policy_out/kernel", "shape": [168, 7]}, {"dtype": "float32", "name": "policy_out/bias", "shape": [7]}], "paths": ["group49-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "value_out/kernel", "shape": [128, 1]}, {"dtype": "float32", "name": "value_out/bias", "shape": [1]}], "paths": ["group50-shard1of1"]}], "modelTopology": {"keras_version": "2.0.8-tf", "training_config": {"loss_weights": null, "loss": ["categorical_crossentropy", "mean_squared_error"], "sample_weight_mode": null, "optimizer_config": {"class_name": "SGD", "config": {"nesterov": false, "decay": 0.0, "momentum": 0.8999999761581421, "lr": 0.06960000097751617}}, "metrics": null}, "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"output_layers": [["policy_out", 0, 0], ["value_out", 0, 0]], "name": "c4_model", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 2, 6, 7], "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_1", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_1", "beta_constraint": null, "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "config": {"activation": "relu", "name": "activation_1", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_2", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_2", "beta_constraint": null, "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "config": {"activation": "relu", "name": "activation_2", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_3", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_3", "beta_constraint": null, "trainable": true}}, {"class_name": "Add", "inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "name": "add_1", "config": {"dtype": "float32", "name": "add_1", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_3", "config": {"activation": "relu", "name": "activation_3", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_4", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_4", "beta_constraint": null, "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4", "config": {"activation": "relu", "name": "activation_4", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_5", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_5", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_5", "beta_constraint": null, "trainable": true}}, {"class_name": "Add", "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "name": "add_2", "config": {"dtype": "float32", "name": "add_2", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_5", "config": {"activation": "relu", "name": "activation_5", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "conv2d_6", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_6", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_6", "beta_constraint": null, "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6", "config": {"activation": "relu", "name": "activation_6", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "conv2d_7", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_7", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_7", "beta_constraint": null, "trainable": true}}, {"class_name": "Add", "inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]], "name": "add_3", "config": {"dtype": "float32", "name": "add_3", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_7", "config": {"activation": "relu", "name": "activation_7", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_8", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_8", "beta_constraint": null, "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "activation_8", "config": {"activation": "relu", "name": "activation_8", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "conv2d_9", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_9", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_9", "beta_constraint": null, "trainable": true}}, {"class_name": "Add", "inbound_nodes": [[["activation_7", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "name": "add_4", "config": {"dtype": "float32", "name": "add_4", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_9", "config": {"activation": "relu", "name": "activation_9", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_10", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_10", "beta_constraint": null, "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_10", "config": {"activation": "relu", "name": "activation_10", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "conv2d_11", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_11", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_11", "beta_constraint": null, "trainable": true}}, {"class_name": "Add", "inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]], "name": "add_5", "config": {"dtype": "float32", "name": "add_5", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_11", "config": {"activation": "relu", "name": "activation_11", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "conv2d_12", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_12", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_12", "beta_constraint": null, "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12", "config": {"activation": "relu", "name": "activation_12", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "conv2d_13", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_13", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_13", "beta_constraint": null, "trainable": true}}, {"class_name": "Add", "inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]], "name": "add_6", "config": {"dtype": "float32", "name": "add_6", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_13", "config": {"activation": "relu", "name": "activation_13", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv2d_14", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_14", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_14", "beta_constraint": null, "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "activation_14", "config": {"activation": "relu", "name": "activation_14", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_15", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_15", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_15", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_15", "beta_constraint": null, "trainable": true}}, {"class_name": "Add", "inbound_nodes": [[["activation_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]], "name": "add_7", "config": {"dtype": "float32", "name": "add_7", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_15", "config": {"activation": "relu", "name": "activation_15", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "conv2d_16", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_16", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_16", "beta_constraint": null, "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "activation_16", "config": {"activation": "relu", "name": "activation_16", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_17", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_17", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_17", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_17", "beta_constraint": null, "trainable": true}}, {"class_name": "Add", "inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]], "name": "add_8", "config": {"dtype": "float32", "name": "add_8", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "activation_17", "config": {"activation": "relu", "name": "activation_17", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_18", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_18", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_18", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_18", "beta_constraint": null, "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "activation_18", "config": {"activation": "relu", "name": "activation_18", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "conv2d_19", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_19", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_19", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_19", "beta_constraint": null, "trainable": true}}, {"class_name": "Add", "inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "name": "add_9", "config": {"dtype": "float32", "name": "add_9", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "activation_19", "config": {"activation": "relu", "name": "activation_19", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "conv2d_20", "config": {"dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_20", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_20", "config": {"center": true, "dtype": "float32", "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "name": "batch_normalization_20", "beta_constraint": null, "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "name": "activation_20", "config": 