{"modelTopology": {"backend": "tensorflow", "keras_version": "2.0.8-tf", "model_config": {"class_name": "Model", "config": {"name": "c4_model", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 2, 6, 7], "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_1", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"name": "activation_1", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_2", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"name": "activation_2", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_3", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"name": "add_1", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"name": "activation_3", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_4", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"name": "activation_4", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_5", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"name": "add_2", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"name": "activation_5", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_6", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"name": "activation_6", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_7", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_7", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"name": "add_3", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"name": "activation_7", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_8", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_8", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"name": "activation_8", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_9", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_9", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"name": "add_4", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["activation_7", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"name": "activation_9", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_10", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_10", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_10", "config": {"name": "activation_10", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_11", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_11", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_5", "config": {"name": "add_5", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_11", "config": {"name": "activation_11", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_12", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_12", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_12", "config": {"name": "activation_12", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_13", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_13", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_6", "config": {"name": "add_6", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_13", "config": {"name": "activation_13", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_14", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_14", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_14", "config": {"name": "activation_14", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_15", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_15", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_7", "config": {"name": "add_7", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["activation_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_15", "config": {"name": "activation_15", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_16", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_16", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_16", "config": {"name": "activation_16", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_17", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_17", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_17", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_8", "config": {"name": "add_8", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_17", "config": {"name": "activation_17", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_18", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_18", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_18", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_18", "config": {"name": "activation_18", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_19", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_19", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_19", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_9", "config": {"name": "add_9", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_19", "config": {"name": "activation_19", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_20", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_20", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_20", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_20", "config": {"name": "activation_20", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_21", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_21", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "same", "use_bias": true}, "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_21", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_10", "config": {"name": "add_10", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["activation_19", 0, 0, {}], ["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_21", "config": {"name": "activation_21", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_23", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 4, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_23", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "valid", "use_bias": true}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_23", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_23", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_23", "config": {"name": "activation_23", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_22", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 4, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_22", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "padding": "valid", "use_bias": true}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_2", "config": {"name": "flatten_2", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_22", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "dense_1", "units": 128, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "use_bias": true}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_22", "config": {"name": "activation_22", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_24", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_24", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_24", "config": {"name": "activation_24", "activation": "relu", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "Dense", "name": "policy_out", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "policy_out", "units": 7, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "use_bias": true}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "value_out", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "value_out", "units": 1, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "use_bias": true}, "inbound_nodes": [[["activation_24", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["policy_out", 0, 0], ["value_out", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "SGD", "config": {"nesterov": false, "decay": 0.0, "momentum": 0.8999999761581421, "lr": 0.019999999552965164}}, "loss_weights": null, "loss": ["categorical_crossentropy", "mean_squared_error"], "metrics": null, "sample_weight_mode": null}}, "weightsManifest": [{"weights": [{"name": "batch_normalization_1/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_1/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_1/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_1/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group1-shard1of1"]}, {"weights": [{"name": "batch_normalization_10/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_10/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_10/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_10/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group2-shard1of1"]}, {"weights": [{"name": "batch_normalization_11/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_11/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_11/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_11/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group3-shard1of1"]}, {"weights": [{"name": "batch_normalization_12/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_12/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_12/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_12/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group4-shard1of1"]}, {"weights": [{"name": "batch_normalization_13/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_13/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_13/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_13/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group5-shard1of1"]}, {"weights": [{"name": "batch_normalization_14/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_14/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_14/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_14/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group6-shard1of1"]}, {"weights": [{"name": "batch_normalization_15/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_15/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_15/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_15/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group7-shard1of1"]}, {"weights": [{"name": "batch_normalization_16/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_16/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_16/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_16/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group8-shard1of1"]}, {"weights": [{"name": "batch_normalization_17/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_17/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_17/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_17/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group9-shard1of1"]}, {"weights": [{"name": "batch_normalization_18/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_18/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_18/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_18/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group10-shard1of1"]}, {"weights": [{"name": "batch_normalization_19/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_19/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_19/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_19/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group11-shard1of1"]}, {"weights": [{"name": "batch_normalization_2/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_2/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_2/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_2/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group12-shard1of1"]}, {"weights": [{"name": "batch_normalization_20/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_20/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_20/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_20/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group13-shard1of1"]}, {"weights": [{"name": "batch_normalization_21/gamma", "dtype": "float32", "shape": [32]}, {"name": 