{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_1/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_1/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_1/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_1/moving_variance"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_10/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_10/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_10/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_10/moving_variance"}]}, {"paths": ["group3-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_11/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_11/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_11/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_11/moving_variance"}]}, {"paths": ["group4-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_12/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_12/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_12/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_12/moving_variance"}]}, {"paths": ["group5-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_13/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_13/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_13/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_13/moving_variance"}]}, {"paths": ["group6-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_14/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_14/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_14/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_14/moving_variance"}]}, {"paths": ["group7-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_15/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_15/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_15/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_15/moving_variance"}]}, {"paths": ["group8-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_16/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_16/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_16/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_16/moving_variance"}]}, {"paths": ["group9-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_17/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_17/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_17/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_17/moving_variance"}]}, {"paths": ["group10-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_18/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_18/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_18/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_18/moving_variance"}]}, {"paths": ["group11-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_19/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_19/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_19/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_19/moving_variance"}]}, {"paths": ["group12-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_2/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_2/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_2/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_2/moving_variance"}]}, {"paths": ["group13-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_20/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_20/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_20/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_20/moving_variance"}]}, {"paths": ["group14-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_21/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_21/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_21/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_21/moving_variance"}]}, {"paths": ["group15-shard1of1"], "weights": [{"shape": [4], "dtype": "float32", "name": "batch_normalization_22/gamma"}, {"shape": [4], "dtype": "float32", "name": "batch_normalization_22/beta"}, {"shape": [4], "dtype": "float32", "name": "batch_normalization_22/moving_mean"}, {"shape": [4], "dtype": "float32", "name": "batch_normalization_22/moving_variance"}]}, {"paths": ["group16-shard1of1"], "weights": [{"shape": [4], "dtype": "float32", "name": "batch_normalization_23/gamma"}, {"shape": [4], "dtype": "float32", "name": "batch_normalization_23/beta"}, {"shape": [4], "dtype": "float32", "name": "batch_normalization_23/moving_mean"}, {"shape": [4], "dtype": "float32", "name": "batch_normalization_23/moving_variance"}]}, {"paths": ["group17-shard1of1"], "weights": [{"shape": [128], "dtype": "float32", "name": "batch_normalization_24/gamma"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_24/beta"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_24/moving_mean"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_24/moving_variance"}]}, {"paths": ["group18-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_3/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_3/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_3/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_3/moving_variance"}]}, {"paths": ["group19-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_4/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_4/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_4/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_4/moving_variance"}]}, {"paths": ["group20-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_5/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_5/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_5/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_5/moving_variance"}]}, {"paths": ["group21-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_6/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_6/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_6/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_6/moving_variance"}]}, {"paths": ["group22-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_7/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_7/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_7/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_7/moving_variance"}]}, {"paths": ["group23-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_8/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_8/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_8/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_8/moving_variance"}]}, {"paths": ["group24-shard1of1"], "weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_9/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_9/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_9/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_9/moving_variance"}]}, {"paths": ["group25-shard1of1"], "weights": [{"shape": [3, 3, 2, 32], "dtype": "float32", "name": "conv2d_1/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_1/bias"}]}, {"paths": ["group26-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_10/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_10/bias"}]}, {"paths": ["group27-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_11/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_11/bias"}]}, {"paths": ["group28-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_12/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_12/bias"}]}, {"paths": ["group29-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_13/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_13/bias"}]}, {"paths": ["group30-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_14/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_14/bias"}]}, {"paths": ["group31-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_15/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_15/bias"}]}, {"paths": ["group32-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_16/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_16/bias"}]}, {"paths": ["group33-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_17/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_17/bias"}]}, {"paths": ["group34-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_18/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_18/bias"}]}, {"paths": ["group35-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_19/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_19/bias"}]}, {"paths": ["group36-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_2/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_2/bias"}]}, {"paths": ["group37-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_20/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_20/bias"}]}, {"paths": ["group38-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_21/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_21/bias"}]}, {"paths": ["group39-shard1of1"], "weights": [{"shape": [1, 1, 32, 4], "dtype": "float32", "name": "conv2d_22/kernel"}, {"shape": [4], "dtype": "float32", "name": "conv2d_22/bias"}]}, {"paths": ["group40-shard1of1"], "weights": [{"shape": [1, 1, 32, 4], "dtype": "float32", "name": "conv2d_23/kernel"}, {"shape": [4], "dtype": "float32", "name": "conv2d_23/bias"}]}, {"paths": ["group41-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_3/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_3/bias"}]}, {"paths": ["group42-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_4/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_4/bias"}]}, {"paths": ["group43-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_5/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_5/bias"}]}, {"paths": ["group44-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_6/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_6/bias"}]}, {"paths": ["group45-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_7/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_7/bias"}]}, {"paths": ["group46-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_8/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_8/bias"}]}, {"paths": ["group47-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_9/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_9/bias"}]}, {"paths": ["group48-shard1of1"], "weights": [{"shape": [168, 128], "dtype": "float32", "name": "dense_1/kernel"}, {"shape": [128], "dtype": "float32", "name": "dense_1/bias"}]}, {"paths": ["group49-shard1of1"], "weights": [{"shape": [168, 7], "dtype": "float32", "name": "policy_out/kernel"}, {"shape": [7], "dtype": "float32", "name": "policy_out/bias"}]}, {"paths": ["group50-shard1of1"], "weights": [{"shape": [128, 1], "dtype": "float32", "name": "value_out/kernel"}, {"shape": [1], "dtype": "float32", "name": "value_out/bias"}]}], "modelTopology": {"keras_version": "2.0.8-tf", "model_config": {"config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 2, 6, 7], "name": "input_1", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_1", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_1", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_1"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_2", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_2", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "name": "activation_2"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_3", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_3", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_3"}, {"config": {"dtype": "float32", "trainable": true, "name": "add_1"}, "inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "class_name": "Add", "name": "add_1"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_3"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_4", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_4", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_4"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "name": "activation_4"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_5", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_5", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_5"}, {"config": {"dtype": "float32", "trainable": true, "name": "add_2"}, "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "class_name": "Add", "name": "add_2"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Activation", "name": "activation_5"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_6", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_6", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_6"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "name": "activation_6"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_7", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_7", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_7"}, {"config": {"dtype": "float32", "trainable": true, "name": "add_3"}, "inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]], "class_name": "Add", "name": "add_3"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Activation", "name": "activation_7"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_8", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_8", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_8"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_8"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation", "name": "activation_8"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_9", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_9", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_9"}, {"config": {"dtype": "float32", "trainable": true, "name": "add_4"}, "inbound_nodes": [[["activation_7", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "class_name": "Add", "name": "add_4"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_9"}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "Activation", "name": "activation_9"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_10", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_10", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_10"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_10"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "name": "activation_10"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_11", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_11", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_11"}, {"config": {"dtype": "float32", "trainable": true, "name": "add_5"}, "inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]], "class_name": "Add", "name": "add_5"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_11"}, "inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "Activation", "name": "activation_11"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_12", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_12", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_12"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_12"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation", "name": "activation_12"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_13", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_13", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_13"}, {"config": {"dtype": "float32", "trainable": true, "name": "add_6"}, "inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]], "class_name": "Add", "name": "add_6"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_13"}, "inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "Activation", "name": "activation_13"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_14", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_14", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_14"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_14"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Activation", "name": "activation_14"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_15", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_15", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_15"}, {"config": {"dtype": "float32", "trainable": true, "name": "add_7"}, "inbound_nodes": [[["activation_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]], "class_name": "Add", "name": "add_7"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_15"}, "inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "Activation", "name": "activation_15"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_16", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_15", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_16"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_16", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_16"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_16"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "Activation", "name": "activation_16"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_17", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_17"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_17", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_17"}, {"config": {"dtype": "float32", "trainable": true, "name": "add_8"}, "inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]], "class_name": "Add", "name": "add_8"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_17"}, "inbound_nodes": [[["add_8", 0, 0, {}]]], "class_name": "Activation", "name": "activation_17"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_18", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_18"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_18", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_18"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_18"}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "Activation", "name": "activation_18"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_19", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_18", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_19"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_19", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_19"}, {"config": {"dtype": "float32", "trainable": true, "name": "add_9"}, "inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "class_name": "Add", "name": "add_9"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_19"}, "inbound_nodes": [[["add_9", 0, 0, {}]]], "class_name": "Activation", "name": "activation_19"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_20", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["activation_19", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_20"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_20", "momentum": 0.99, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_20"}, {"config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_20"}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "class_name": "Activation", "name": "activation_20"}, {"config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "use_bias": true, "name": "conv2d_21", "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 